; bank_00.asm 分片 2/5 (原文件行 1001-2000, 共 4621 行)

C - - - - - 0x000737 00:8727: E6 ED     INC ram_00ED
C - - - - - 0x000739 00:8729: A5 ED     LDA ram_00ED
C - - - - - 0x00073B 00:872B: C9 04     CMP #$04
C - - - - - 0x00073D 00:872D: 90 E8     BCC $8717
C - - - - - 0x00073F 00:872F: A9 02     LDA #$02
C - - - - - 0x000741 00:8731: 4C 79 88  JMP $8879
C - - - - - 0x000744 00:8734: A0 FC     LDY #$FC
C - - - - - 0x000746 00:8736: B9 D2 88  LDA $88D2,Y
C - - - - - 0x000749 00:8739: 99 68 04  STA ram_0468,Y
C - - - - - 0x00074C 00:873C: C8        INY
C - - - - - 0x00074D 00:873D: D0 F7     BNE $8736
C - - - - - 0x00074F 00:873F: A2 F8     LDX #$F8
C - - - - - 0x000751 00:8741: A0 00     LDY #$00
C D 0 - - - 0x000753 00:8743: A9 01     LDA #$01
C - - - - - 0x000755 00:8745: 20 A8 9F  JSR $9FA8
C - - - - - 0x000758 00:8748: 24 1E     BIT ram_001E
C - - - - - 0x00075A 00:874A: 30 17     BMI $8763
C - - - - - 0x00075C 00:874C: A5 1C     LDA ram_001C
C - - - - - 0x00075E 00:874E: 29 44     AND #$44
C - - - - - 0x000760 00:8750: C9 44     CMP #$44
C - - - - - 0x000762 00:8752: F0 1A     BEQ $876E
C - - - - - 0x000764 00:8754: C8        INY
C - - - - - 0x000765 00:8755: C0 14     CPY #$14
C - - - - - 0x000767 00:8757: F0 DB     BEQ $8734
C - - - - - 0x000769 00:8759: C0 0C     CPY #$0C
C - - - - - 0x00076B 00:875B: D0 E6     BNE $8743
C - - - - - 0x00076D 00:875D: 8E 64 05  STX ram_0564
C - - - - - 0x000770 00:8760: 4C 43 87  JMP $8743
C - - - - - 0x000773 00:8763: 8E 64 05  STX ram_0564
C - - - - - 0x000776 00:8766: 20 B1 88  JSR $88B1
C - - - - - 0x000779 00:8769: A9 03     LDA #$03
C - - - - - 0x00077B 00:876B: 4C 87 88  JMP $8887
- - - - - - 0x00077E 00:876E: 8E        .byte $8E   ; 
- - - - - - 0x00077F 00:876F: 64        .byte $64   ; <d>
- - - - - - 0x000780 00:8770: 05        .byte $05   ; 
- - - - - - 0x000781 00:8771: 20        .byte $20   ; 
- - - - - - 0x000782 00:8772: B1        .byte $B1   ; 
- - - - - - 0x000783 00:8773: 88        .byte $88   ; 
- - - - - - 0x000784 00:8774: A5        .byte $A5   ; 
- - - - - - 0x000785 00:8775: 4D        .byte $4D   ; <M>
- - - - - - 0x000786 00:8776: 18        .byte $18   ; 
- - - - - - 0x000787 00:8777: 69        .byte $69   ; <i>
- - - - - - 0x000788 00:8778: 03        .byte $03   ; 
- - - - - - 0x000789 00:8779: 85        .byte $85   ; 
- - - - - - 0x00078A 00:877A: 58        .byte $58   ; <X>
- - - - - - 0x00078B 00:877B: A5        .byte $A5   ; 
- - - - - - 0x00078C 00:877C: 4E        .byte $4E   ; <N>
- - - - - - 0x00078D 00:877D: 69        .byte $69   ; <i>
- - - - - - 0x00078E 00:877E: 00        .byte $00   ; 
- - - - - - 0x00078F 00:877F: 85        .byte $85   ; 
- - - - - - 0x000790 00:8780: 59        .byte $59   ; <Y>
- - - - - - 0x000791 00:8781: A5        .byte $A5   ; 
- - - - - - 0x000792 00:8782: 56        .byte $56   ; <V>
- - - - - - 0x000793 00:8783: 85        .byte $85   ; 
- - - - - - 0x000794 00:8784: 5A        .byte $5A   ; <Z>
- - - - - - 0x000795 00:8785: A0        .byte $A0   ; 
- - - - - - 0x000796 00:8786: 02        .byte $02   ; 
- - - - - - 0x000797 00:8787: B1        .byte $B1   ; 
- - - - - - 0x000798 00:8788: 4D        .byte $4D   ; <M>
- - - - - - 0x000799 00:8789: 0A        .byte $0A   ; 
- - - - - - 0x00079A 00:878A: A8        .byte $A8   ; 
- - - - - - 0x00079B 00:878B: A2        .byte $A2   ; 
- - - - - - 0x00079C 00:878C: 06        .byte $06   ; 
- - - - - - 0x00079D 00:878D: 86        .byte $86   ; 
- - - - - - 0x00079E 00:878E: 56        .byte $56   ; <V>
- - - - - - 0x00079F 00:878F: 20        .byte $20   ; 
- - - - - - 0x0007A0 00:8790: B9        .byte $B9   ; 
- - - - - - 0x0007A1 00:8791: C4        .byte $C4   ; 
- - - - - - 0x0007A2 00:8792: B9        .byte $B9   ; 
- - - - - - 0x0007A3 00:8793: 00        .byte $00   ; 
- - - - - - 0x0007A4 00:8794: A0        .byte $A0   ; 
- - - - - - 0x0007A5 00:8795: 85        .byte $85   ; 
- - - - - - 0x0007A6 00:8796: 4D        .byte $4D   ; <M>
- - - - - - 0x0007A7 00:8797: B9        .byte $B9   ; 
- - - - - - 0x0007A8 00:8798: 01        .byte $01   ; 
- - - - - - 0x0007A9 00:8799: A0        .byte $A0   ; 
- - - - - - 0x0007AA 00:879A: 85        .byte $85   ; 
- - - - - - 0x0007AB 00:879B: 4E        .byte $4E   ; <N>
- - - - - - 0x0007AC 00:879C: 4C        .byte $4C   ; <L>
- - - - - - 0x0007AD 00:879D: D7        .byte $D7   ; 
- - - - - - 0x0007AE 00:879E: 84        .byte $84   ; 
- - - - - - 0x0007AF 00:879F: 20        .byte $20   ; 
- - - - - - 0x0007B0 00:87A0: B1        .byte $B1   ; 
- - - - - - 0x0007B1 00:87A1: 88        .byte $88   ; 
- - - - - - 0x0007B2 00:87A2: A5        .byte $A5   ; 
- - - - - - 0x0007B3 00:87A3: 58        .byte $58   ; <X>
- - - - - - 0x0007B4 00:87A4: 85        .byte $85   ; 
- - - - - - 0x0007B5 00:87A5: 4D        .byte $4D   ; <M>
- - - - - - 0x0007B6 00:87A6: A5        .byte $A5   ; 
- - - - - - 0x0007B7 00:87A7: 59        .byte $59   ; <Y>
- - - - - - 0x0007B8 00:87A8: 85        .byte $85   ; 
- - - - - - 0x0007B9 00:87A9: 4E        .byte $4E   ; <N>
- - - - - - 0x0007BA 00:87AA: A6        .byte $A6   ; 
- - - - - - 0x0007BB 00:87AB: 5A        .byte $5A   ; <Z>
- - - - - - 0x0007BC 00:87AC: 86        .byte $86   ; 
- - - - - - 0x0007BD 00:87AD: 56        .byte $56   ; <V>
- - - - - - 0x0007BE 00:87AE: 20        .byte $20   ; 
- - - - - - 0x0007BF 00:87AF: B9        .byte $B9   ; 
- - - - - - 0x0007C0 00:87B0: C4        .byte $C4   ; 
- - - - - - 0x0007C1 00:87B1: 4C        .byte $4C   ; <L>
- - - - - - 0x0007C2 00:87B2: D7        .byte $D7   ; 
- - - - - - 0x0007C3 00:87B3: 84        .byte $84   ; 
- D 0 - - - 0x0007C4 00:87B4: 30        .byte $30   ; <0>
- D 0 - - - 0x0007C5 00:87B5: 20        .byte $20   ; 
- D 0 - - - 0x0007C6 00:87B6: 10        .byte $10   ; 
- D 0 - - - 0x0007C7 00:87B7: 0F        .byte $0F   ; 
C - - - - - 0x0007C8 00:87B8: C8        INY
C - - - - - 0x0007C9 00:87B9: A2 00     LDX #$00
C - - - - - 0x0007CB 00:87BB: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0007CD 00:87BD: C9 FF     CMP #$FF
C - - - - - 0x0007CF 00:87BF: F0 03     BEQ $87C4
C - - - - - 0x0007D1 00:87C1: 09 80     ORA #$80
C - - - - - 0x0007D3 00:87C3: AA        TAX
C - - - - - 0x0007D4 00:87C4: 86 4C     STX ram_004C
C - - - - - 0x0007D6 00:87C6: A9 02     LDA #$02
C - - - - - 0x0007D8 00:87C8: 4C 79 88  JMP $8879
C - - - - - 0x0007DB 00:87CB: 20 9A 89  JSR $899A
C - - - - - 0x0007DE 00:87CE: C8        INY
C - - - - - 0x0007DF 00:87CF: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0007E1 00:87D1: 20 A8 9F  JSR $9FA8
C - - - - - 0x0007E4 00:87D4: A9 02     LDA #$02
C - - - - - 0x0007E6 00:87D6: 4C 79 88  JMP $8879
C - - - - - 0x0007E9 00:87D9: A5 09     LDA ram_0009
C - - - - - 0x0007EB 00:87DB: F0 08     BEQ $87E5
- - - - - - 0x0007ED 00:87DD: A9        .byte $A9   ; 
- - - - - - 0x0007EE 00:87DE: 01        .byte $01   ; 
- - - - - - 0x0007EF 00:87DF: 20        .byte $20   ; 
- - - - - - 0x0007F0 00:87E0: A8        .byte $A8   ; 
- - - - - - 0x0007F1 00:87E1: 9F        .byte $9F   ; 
- - - - - - 0x0007F2 00:87E2: 4C        .byte $4C   ; <L>
- - - - - - 0x0007F3 00:87E3: D9        .byte $D9   ; 
- - - - - - 0x0007F4 00:87E4: 87        .byte $87   ; 
C - - - - - 0x0007F5 00:87E5: A5 7B     LDA ram_007B
C - - - - - 0x0007F7 00:87E7: 49 01     EOR #$01
C - - - - - 0x0007F9 00:87E9: 85 7B     STA ram_007B
C - - - - - 0x0007FB 00:87EB: A9 00     LDA #$00
C - - - - - 0x0007FD 00:87ED: 85 7A     STA ram_007A
C - - - - - 0x0007FF 00:87EF: 85 44     STA ram_0044
C - - - - - 0x000801 00:87F1: 85 45     STA ram_0045
C - - - - - 0x000803 00:87F3: A9 01     LDA #$01
C - - - - - 0x000805 00:87F5: 4C 79 88  JMP $8879
C - - - - - 0x000808 00:87F8: C8        INY
C - - - - - 0x000809 00:87F9: B1 4D     LDA (ram_004D),Y
C - - - - - 0x00080B 00:87FB: 85 ED     STA ram_00ED
C - - - - - 0x00080D 00:87FD: C8        INY
C - - - - - 0x00080E 00:87FE: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000810 00:8800: 85 EC     STA ram_00EC
C - - - - - 0x000812 00:8802: A2 02     LDX #$02
C - - - - - 0x000814 00:8804: 20 B9 C4  JSR $C4B9
C - - - - - 0x000817 00:8807: 20 12 A2  JSR $A212
C - - - - - 0x00081A 00:880A: A8        TAY
C - - - - - 0x00081B 00:880B: A6 56     LDX ram_0056
C - - - - - 0x00081D 00:880D: 20 B9 C4  JSR $C4B9
C - - - - - 0x000820 00:8810: 98        TYA
C - - - - - 0x000821 00:8811: 4C 79 88  JMP $8879
C - - - - - 0x000824 00:8814: A5 5B     LDA ram_005B
C - - - - - 0x000826 00:8816: 29 FB     AND #$FB
C - - - - - 0x000828 00:8818: 4C 1F 88  JMP $881F
C - - - - - 0x00082B 00:881B: A5 5B     LDA ram_005B
C - - - - - 0x00082D 00:881D: 09 04     ORA #$04
C D 0 - - - 0x00082F 00:881F: 85 5B     STA ram_005B
C - - - - - 0x000831 00:8821: C8        INY
C - - - - - 0x000832 00:8822: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000834 00:8824: 20 F7 8A  JSR $8AF7
C - - - - - 0x000837 00:8827: A6 56     LDX ram_0056
C - - - - - 0x000839 00:8829: 20 B9 C4  JSR $C4B9
C - - - - - 0x00083C 00:882C: A9 02     LDA #$02
C - - - - - 0x00083E 00:882E: 4C 79 88  JMP $8879
C - - - - - 0x000841 00:8831: 20 85 90  JSR $9085
C - - - - - 0x000844 00:8834: 4C E7 84  JMP $84E7
C - - - - - 0x000847 00:8837: 20 9A 89  JSR $899A
C - - - - - 0x00084A 00:883A: A9 04     LDA #$04
C - - - - - 0x00084C 00:883C: 20 A8 9F  JSR $9FA8
C - - - - - 0x00084F 00:883F: A5 51     LDA ram_0051
C - - - - - 0x000851 00:8841: 18        CLC
C - - - - - 0x000852 00:8842: 69 40     ADC #$40
C - - - - - 0x000854 00:8844: 85 51     STA ram_0051
C - - - - - 0x000856 00:8846: A5 52     LDA ram_0052
C - - - - - 0x000858 00:8848: 69 00     ADC #$00
C - - - - - 0x00085A 00:884A: 85 52     STA ram_0052
C - - - - - 0x00085C 00:884C: E6 4D     INC ram_004D
C - - - - - 0x00085E 00:884E: D0 02     BNE $8852
C - - - - - 0x000860 00:8850: E6 4E     INC ram_004E
C - - - - - 0x000862 00:8852: 4C E3 84  JMP $84E3
C - - - - - 0x000865 00:8855: 20 B1 88  JSR $88B1
C - - - - - 0x000868 00:8858: A9 04     LDA #$04
C - - - - - 0x00086A 00:885A: 20 A8 9F  JSR $9FA8
C - - - - - 0x00086D 00:885D: A9 01     LDA #$01
C - - - - - 0x00086F 00:885F: 4C 87 88  JMP $8887
C - - - - - 0x000872 00:8862: C8        INY
C - - - - - 0x000873 00:8863: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000875 00:8865: AA        TAX
C - - - - - 0x000876 00:8866: C8        INY
C - - - - - 0x000877 00:8867: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000879 00:8869: 85 4E     STA ram_004E
C - - - - - 0x00087B 00:886B: 86 4D     STX ram_004D
C - - - - - 0x00087D 00:886D: 4C E7 84  JMP $84E7
C - - - - - 0x000880 00:8870: A9 00     LDA #$00
C - - - - - 0x000882 00:8872: 85 4D     STA ram_004D
C - - - - - 0x000884 00:8874: 85 4E     STA ram_004E
C - - - - - 0x000886 00:8876: 4C 7E 9F  JMP $9F7E
C D 0 - - - 0x000889 00:8879: 18        CLC
C - - - - - 0x00088A 00:887A: 65 4D     ADC ram_004D
C - - - - - 0x00088C 00:887C: 85 4D     STA ram_004D
C - - - - - 0x00088E 00:887E: A5 4E     LDA ram_004E
C - - - - - 0x000890 00:8880: 69 00     ADC #$00
C - - - - - 0x000892 00:8882: 85 4E     STA ram_004E
C - - - - - 0x000894 00:8884: 4C E7 84  JMP $84E7
C D 0 - - - 0x000897 00:8887: 18        CLC
C - - - - - 0x000898 00:8888: 65 4D     ADC ram_004D
C - - - - - 0x00089A 00:888A: 85 4D     STA ram_004D
C - - - - - 0x00089C 00:888C: A5 4E     LDA ram_004E
C - - - - - 0x00089E 00:888E: 69 00     ADC #$00
C - - - - - 0x0008A0 00:8890: 85 4E     STA ram_004E
C - - - - - 0x0008A2 00:8892: 4C D7 84  JMP $84D7
C - - - - - 0x0008A5 00:8895: 85 57     STA ram_0057
C - - - - - 0x0008A7 00:8897: A2 0D     LDX #$0D
C - - - - - 0x0008A9 00:8899: A9 A8     LDA #$A8
C - - - - - 0x0008AB 00:889B: 95 00     STA ram_0000,X
C - - - - - 0x0008AD 00:889D: A9 88     LDA #$88
C - - - - - 0x0008AF 00:889F: 95 01     STA ram_0001,X
C - - - - - 0x0008B1 00:88A1: A0 A0     LDY #$A0
C - - - - - 0x0008B3 00:88A3: A9 00     LDA #$00
C - - - - - 0x0008B5 00:88A5: 20 69 9F  JSR $9F69
C - - - - - 0x0008B8 00:88A8: 60        RTS
C - - - - - 0x0008B9 00:88A9: A2 02     LDX #$02
C - - - - - 0x0008BB 00:88AB: 20 B9 C4  JSR $C4B9
C - - - - - 0x0008BE 00:88AE: 4C 06 A2  JMP $A206
C - - - - - 0x0008C1 00:88B1: A5 54     LDA ram_0054
C - - - - - 0x0008C3 00:88B3: 49 FF     EOR #$FF
C - - - - - 0x0008C5 00:88B5: 18        CLC
C - - - - - 0x0008C6 00:88B6: 69 1F     ADC #$1F
C - - - - - 0x0008C8 00:88B8: AA        TAX
C - - - - - 0x0008C9 00:88B9: A0 08     LDY #$08
C - - - - - 0x0008CB 00:88BB: A5 4F     LDA ram_004F
C - - - - - 0x0008CD 00:88BD: 29 E0     AND #$E0
C - - - - - 0x0008CF 00:88BF: 05 54     ORA ram_0054
C - - - - - 0x0008D1 00:88C1: 85 E6     STA ram_00E6
C - - - - - 0x0008D3 00:88C3: A5 50     LDA ram_0050
C - - - - - 0x0008D5 00:88C5: 85 E7     STA ram_00E7
C - - - - - 0x0008D7 00:88C7: 4C E8 98  JMP $98E8
C - - - - - 0x0008DA 00:88CA: 48        PHA
C - - - - - 0x0008DB 00:88CB: A9 82     LDA #$82
C - - - - - 0x0008DD 00:88CD: 20 28 9B  JSR $9B28
C - - - - - 0x0008E0 00:88D0: 68        PLA
C - - - - - 0x0008E1 00:88D1: C9 A0     CMP #$A0
C - - - - - 0x0008E3 00:88D3: 90 18     BCC $88ED
C - - - - - 0x0008E5 00:88D5: 48        PHA
C - - - - - 0x0008E6 00:88D6: C9 C8     CMP #$C8
C - - - - - 0x0008E8 00:88D8: A9 94     LDA #$94
C - - - - - 0x0008EA 00:88DA: 69 00     ADC #$00
C - - - - - 0x0008EC 00:88DC: 9D E8 05  STA ram_05E8,X
C - - - - - 0x0008EF 00:88DF: E8        INX
C - - - - - 0x0008F0 00:88E0: 68        PLA
C - - - - - 0x0008F1 00:88E1: A8        TAY
C - - - - - 0x0008F2 00:88E2: B9 14 8A  LDA $8A14,Y
C - - - - - 0x0008F5 00:88E5: 9D E8 05  STA ram_05E8,X
C - - - - - 0x0008F8 00:88E8: E8        INX
C - - - - - 0x0008F9 00:88E9: 20 5E 9B  JSR $9B5E
C - - - - - 0x0008FC 00:88EC: 60        RTS
C - - - - - 0x0008FD 00:88ED: 9D E9 05  STA ram_05E9,X
C - - - - - 0x000900 00:88F0: A9 00     LDA #$00
C - - - - - 0x000902 00:88F2: 9D E8 05  STA ram_05E8,X
C - - - - - 0x000905 00:88F5: E8        INX
C - - - - - 0x000906 00:88F6: E8        INX
C - - - - - 0x000907 00:88F7: 20 5E 9B  JSR $9B5E
C - - - - - 0x00090A 00:88FA: 60        RTS
C - - - - - 0x00090B 00:88FB: A2 00     LDX #$00
C - - - - - 0x00090D 00:88FD: BD 6A 04  LDA ram_046A,X
C - - - - - 0x000910 00:8900: 49 20     EOR #$20
C - - - - - 0x000912 00:8902: 9D 6A 04  STA ram_046A,X
C - - - - - 0x000915 00:8905: E8        INX
C - - - - - 0x000916 00:8906: E8        INX
C - - - - - 0x000917 00:8907: E8        INX
C - - - - - 0x000918 00:8908: E8        INX
C - - - - - 0x000919 00:8909: D0 F2     BNE $88FD
C - - - - - 0x00091B 00:890B: 60        RTS
C - - - - - 0x00091C 00:890C: 85 ED     STA ram_00ED
C - - - - - 0x00091E 00:890E: A2 00     LDX #$00
C - - - - - 0x000920 00:8910: BD 68 04  LDA ram_0468,X
C - - - - - 0x000923 00:8913: 18        CLC
C - - - - - 0x000924 00:8914: 65 ED     ADC ram_00ED
C - - - - - 0x000926 00:8916: 9D 68 04  STA ram_0468,X
C - - - - - 0x000929 00:8919: E8        INX
C - - - - - 0x00092A 00:891A: E8        INX
C - - - - - 0x00092B 00:891B: E8        INX
C - - - - - 0x00092C 00:891C: E8        INX
C - - - - - 0x00092D 00:891D: D0 F1     BNE $8910
C - - - - - 0x00092F 00:891F: 60        RTS
C - - - - - 0x000930 00:8920: A2 13     LDX #$13
C - - - - - 0x000932 00:8922: 20 EE 9D  JSR $9DEE
C - - - - - 0x000935 00:8925: A5 EC     LDA ram_00EC
C - - - - - 0x000937 00:8927: 18        CLC
C - - - - - 0x000938 00:8928: 69 00     ADC #$00
C - - - - - 0x00093A 00:892A: 85 EC     STA ram_00EC
C - - - - - 0x00093C 00:892C: A5 ED     LDA ram_00ED
C - - - - - 0x00093E 00:892E: 69 BF     ADC #$BF
C - - - - - 0x000940 00:8930: 85 ED     STA ram_00ED
C - - - - - 0x000942 00:8932: A5 25     LDA ram_0025
C - - - - - 0x000944 00:8934: 85 EA     STA ram_00EA
C - - - - - 0x000946 00:8936: A2 06     LDX #$06
C - - - - - 0x000948 00:8938: 20 B9 C4  JSR $C4B9
C - - - - - 0x00094B 00:893B: A5 78     LDA ram_0078
C - - - - - 0x00094D 00:893D: D0 FC     BNE $893B
C - - - - - 0x00094F 00:893F: A0 00     LDY #$00
C - - - - - 0x000951 00:8941: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000953 00:8943: 8D 79 00  STA a: ram_0079
C - - - - - 0x000956 00:8946: A9 00     LDA #$00
C - - - - - 0x000958 00:8948: 8D 7A 00  STA a: ram_007A
C - - - - - 0x00095B 00:894B: C8        INY
C - - - - - 0x00095C 00:894C: A2 12     LDX #$12
C - - - - - 0x00095E 00:894E: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000960 00:8950: 99 7B 00  STA ram_007B,Y
C - - - - - 0x000963 00:8953: C8        INY
C - - - - - 0x000964 00:8954: CA        DEX
C - - - - - 0x000965 00:8955: D0 F7     BNE $894E
C - - - - - 0x000967 00:8957: A6 EA     LDX ram_00EA
C - - - - - 0x000969 00:8959: 20 B9 C4  JSR $C4B9
C - - - - - 0x00096C 00:895C: 60        RTS
C - - - - - 0x00096D 00:895D: AA        TAX
C - - - - - 0x00096E 00:895E: A5 99     LDA ram_0099
C - - - - - 0x000970 00:8960: 10 04     BPL $8966
C - - - - - 0x000972 00:8962: 49 41     EOR #$41
C - - - - - 0x000974 00:8964: 85 99     STA ram_0099
C - - - - - 0x000976 00:8966: A9 01     LDA #$01
C - - - - - 0x000978 00:8968: 20 A8 9F  JSR $9FA8
C - - - - - 0x00097B 00:896B: 8A        TXA
C - - - - - 0x00097C 00:896C: 48        PHA
C - - - - - 0x00097D 00:896D: 20 FF 89  JSR $89FF
C - - - - - 0x000980 00:8970: 68        PLA
C - - - - - 0x000981 00:8971: AA        TAX
C - - - - - 0x000982 00:8972: CA        DEX
C - - - - - 0x000983 00:8973: D0 F1     BNE $8966
C - - - - - 0x000985 00:8975: 60        RTS
C - - - - - 0x000986 00:8976: A5 4D     LDA ram_004D
C - - - - - 0x000988 00:8978: 85 EA     STA ram_00EA
C - - - - - 0x00098A 00:897A: A5 4E     LDA ram_004E
C - - - - - 0x00098C 00:897C: 85 EB     STA ram_00EB
C - - - - - 0x00098E 00:897E: A9 02     LDA #$02
C - - - - - 0x000990 00:8980: 85 E6     STA ram_00E6
C - - - - - 0x000992 00:8982: 86 E7     STX ram_00E7
C - - - - - 0x000994 00:8984: 84 E8     STY ram_00E8
C - - - - - 0x000996 00:8986: A9 E5     LDA #$E5
C - - - - - 0x000998 00:8988: 85 4D     STA ram_004D
C - - - - - 0x00099A 00:898A: A9 00     LDA #$00
C - - - - - 0x00099C 00:898C: 85 4E     STA ram_004E
C - - - - - 0x00099E 00:898E: 20 85 90  JSR $9085
C - - - - - 0x0009A1 00:8991: A5 EA     LDA ram_00EA
C - - - - - 0x0009A3 00:8993: 85 4D     STA ram_004D
C - - - - - 0x0009A5 00:8995: A5 EB     LDA ram_00EB
C - - - - - 0x0009A7 00:8997: 85 4E     STA ram_004E
C - - - - - 0x0009A9 00:8999: 60        RTS
C - - - - - 0x0009AA 00:899A: A5 99     LDA ram_0099
C - - - - - 0x0009AC 00:899C: 29 80     AND #$80
C - - - - - 0x0009AE 00:899E: 09 40     ORA #$40
C - - - - - 0x0009B0 00:89A0: 85 99     STA ram_0099
C - - - - - 0x0009B2 00:89A2: 60        RTS
C - - - - - 0x0009B3 00:89A3: A0 FC     LDY #$FC
C - - - - - 0x0009B5 00:89A5: B9 D2 88  LDA $88D2,Y
C - - - - - 0x0009B8 00:89A8: 99 68 04  STA ram_0468,Y
C - - - - - 0x0009BB 00:89AB: C8        INY
C - - - - - 0x0009BC 00:89AC: D0 F7     BNE $89A5
C - - - - - 0x0009BE 00:89AE: A2 F8     LDX #$F8
C - - - - - 0x0009C0 00:89B0: A0 00     LDY #$00
C D 0 - - - 0x0009C2 00:89B2: A9 01     LDA #$01
C - - - - - 0x0009C4 00:89B4: 20 A8 9F  JSR $9FA8
C - - - - - 0x0009C7 00:89B7: A5 1E     LDA ram_001E
C - - - - - 0x0009C9 00:89B9: 30 0F     BMI $89CA
C - - - - - 0x0009CB 00:89BB: C8        INY
C - - - - - 0x0009CC 00:89BC: C0 28     CPY #$28
C - - - - - 0x0009CE 00:89BE: F0 E3     BEQ $89A3
C - - - - - 0x0009D0 00:89C0: C0 18     CPY #$18
C - - - - - 0x0009D2 00:89C2: D0 EE     BNE $89B2
C - - - - - 0x0009D4 00:89C4: 8E 64 05  STX ram_0564
C - - - - - 0x0009D7 00:89C7: 4C B2 89  JMP $89B2
C - - - - - 0x0009DA 00:89CA: 8E 64 05  STX ram_0564
C - - - - - 0x0009DD 00:89CD: 60        RTS
- D 0 - - - 0x0009DE 00:89CE: D0        .byte $D0   ; 
- D 0 - - - 0x0009DF 00:89CF: FF        .byte $FF   ; 
- D 0 - - - 0x0009E0 00:89D0: 03        .byte $03   ; 
- D 0 - - - 0x0009E1 00:89D1: E8        .byte $E8   ; 
C - - - - - 0x0009E2 00:89D2: A8        TAY
C - - - - - 0x0009E3 00:89D3: A2 06     LDX #$06
C - - - - - 0x0009E5 00:89D5: 20 B9 C4  JSR $C4B9
C - - - - - 0x0009E8 00:89D8: 98        TYA
C - - - - - 0x0009E9 00:89D9: 0A        ASL
C - - - - - 0x0009EA 00:89DA: AA        TAX
C - - - - - 0x0009EB 00:89DB: BD 00 BD  LDA $BD00,X
C - - - - - 0x0009EE 00:89DE: 8D 54 06  STA ram_0654
C - - - - - 0x0009F1 00:89E1: BD 01 BD  LDA $BD01,X
C - - - - - 0x0009F4 00:89E4: 8D 55 06  STA ram_0655
C - - - - - 0x0009F7 00:89E7: A9 80     LDA #$80
C - - - - - 0x0009F9 00:89E9: 8D 52 06  STA ram_0652
C - - - - - 0x0009FC 00:89EC: A9 01     LDA #$01
C - - - - - 0x0009FE 00:89EE: 8D 53 06  STA ram_0653
C - - - - - 0x000A01 00:89F1: A9 00     LDA #$00
C - - - - - 0x000A03 00:89F3: 85 90     STA ram_0090
C - - - - - 0x000A05 00:89F5: A9 02     LDA #$02
C - - - - - 0x000A07 00:89F7: 85 91     STA ram_0091
C - - - - - 0x000A09 00:89F9: A6 56     LDX ram_0056
C - - - - - 0x000A0B 00:89FB: 20 B9 C4  JSR $C4B9
C - - - - - 0x000A0E 00:89FE: 60        RTS
C - - - - - 0x000A0F 00:89FF: AD 52 06  LDA ram_0652
C - - - - - 0x000A12 00:8A02: 30 03     BMI $8A07
C - - - - - 0x000A14 00:8A04: 4C 90 8A  JMP $8A90
C - - - - - 0x000A17 00:8A07: CE 53 06  DEC ram_0653
C - - - - - 0x000A1A 00:8A0A: F0 03     BEQ $8A0F
C - - - - - 0x000A1C 00:8A0C: 4C 90 8A  JMP $8A90
C - - - - - 0x000A1F 00:8A0F: A2 06     LDX #$06
C - - - - - 0x000A21 00:8A11: 20 B9 C4  JSR $C4B9
C D 0 - - - 0x000A24 00:8A14: AD 54 06  LDA ram_0654
C - - - - - 0x000A27 00:8A17: 85 E6     STA ram_00E6
C - - - - - 0x000A29 00:8A19: AD 55 06  LDA ram_0655
C - - - - - 0x000A2C 00:8A1C: 85 E7     STA ram_00E7
C - - - - - 0x000A2E 00:8A1E: AD 52 06  LDA ram_0652
C - - - - - 0x000A31 00:8A21: EE 52 06  INC ram_0652
C - - - - - 0x000A34 00:8A24: 29 3F     AND #$3F
C - - - - - 0x000A36 00:8A26: 18        CLC
C - - - - - 0x000A37 00:8A27: 65 E6     ADC ram_00E6
C - - - - - 0x000A39 00:8A29: 85 E6     STA ram_00E6
C - - - - - 0x000A3B 00:8A2B: A5 E7     LDA ram_00E7
C - - - - - 0x000A3D 00:8A2D: 69 00     ADC #$00
C - - - - - 0x000A3F 00:8A2F: 85 E7     STA ram_00E7
C - - - - - 0x000A41 00:8A31: A0 00     LDY #$00
C - - - - - 0x000A43 00:8A33: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x000A45 00:8A35: C9 FF     CMP #$FF
C - - - - - 0x000A47 00:8A37: F0 4D     BEQ $8A86
C - - - - - 0x000A49 00:8A39: C9 FE     CMP #$FE
C - - - - - 0x000A4B 00:8A3B: F0 3E     BEQ $8A7B
C - - - - - 0x000A4D 00:8A3D: 29 F8     AND #$F8
C - - - - - 0x000A4F 00:8A3F: 85 E8     STA ram_00E8
C - - - - - 0x000A51 00:8A41: 4A        LSR
C - - - - - 0x000A52 00:8A42: 18        CLC
C - - - - - 0x000A53 00:8A43: 65 E8     ADC ram_00E8
C - - - - - 0x000A55 00:8A45: 85 E8     STA ram_00E8
C - - - - - 0x000A57 00:8A47: A9 00     LDA #$00
C - - - - - 0x000A59 00:8A49: 69 00     ADC #$00
C - - - - - 0x000A5B 00:8A4B: 85 E9     STA ram_00E9
C - - - - - 0x000A5D 00:8A4D: A5 E8     LDA ram_00E8
C - - - - - 0x000A5F 00:8A4F: 18        CLC
C - - - - - 0x000A60 00:8A50: 69 80     ADC #$80
C - - - - - 0x000A62 00:8A52: 85 E8     STA ram_00E8
C - - - - - 0x000A64 00:8A54: A5 E9     LDA ram_00E9
C - - - - - 0x000A66 00:8A56: 69 BD     ADC #$BD
C - - - - - 0x000A68 00:8A58: 85 E9     STA ram_00E9
C - - - - - 0x000A6A 00:8A5A: A0 02     LDY #$02
C - - - - - 0x000A6C 00:8A5C: A2 23     LDX #$23
C - - - - - 0x000A6E 00:8A5E: 20 91 8A  JSR $8A91
C - - - - - 0x000A71 00:8A61: A0 03     LDY #$03
C - - - - - 0x000A73 00:8A63: A2 23     LDX #$23
C - - - - - 0x000A75 00:8A65: 20 91 8A  JSR $8A91
C - - - - - 0x000A78 00:8A68: A0 04     LDY #$04
C - - - - - 0x000A7A 00:8A6A: A2 23     LDX #$23
C - - - - - 0x000A7C 00:8A6C: 20 91 8A  JSR $8A91
C - - - - - 0x000A7F 00:8A6F: A0 01     LDY #$01
C - - - - - 0x000A81 00:8A71: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x000A83 00:8A73: 29 07     AND #$07
C - - - - - 0x000A85 00:8A75: 8D 53 06  STA ram_0653
C - - - - - 0x000A88 00:8A78: 4C 8B 8A  JMP $8A8B
C - - - - - 0x000A8B 00:8A7B: AD 52 06  LDA ram_0652
C - - - - - 0x000A8E 00:8A7E: 29 C0     AND #$C0
C - - - - - 0x000A90 00:8A80: 8D 52 06  STA ram_0652
C - - - - - 0x000A93 00:8A83: 4C 14 8A  JMP $8A14
- - - - - - 0x000A96 00:8A86: A9        .byte $A9   ; 
- - - - - - 0x000A97 00:8A87: 00        .byte $00   ; 
- - - - - - 0x000A98 00:8A88: 8D        .byte $8D   ; 
- - - - - - 0x000A99 00:8A89: 52        .byte $52   ; <R>
- - - - - - 0x000A9A 00:8A8A: 06        .byte $06   ; 
C D 0 - - - 0x000A9B 00:8A8B: A6 56     LDX ram_0056
C - - - - - 0x000A9D 00:8A8D: 20 B9 C4  JSR $C4B9
C D 0 - - - 0x000AA0 00:8A90: 60        RTS
C - - - - - 0x000AA1 00:8A91: A9 84     LDA #$84
C - - - - - 0x000AA3 00:8A93: 20 28 9B  JSR $9B28
C - - - - - 0x000AA6 00:8A96: A0 00     LDY #$00
C - - - - - 0x000AA8 00:8A98: B1 E8     LDA (ram_00E8),Y
C - - - - - 0x000AAA 00:8A9A: 9D E8 05  STA ram_05E8,X
C - - - - - 0x000AAD 00:8A9D: E8        INX
C - - - - - 0x000AAE 00:8A9E: C8        INY
C - - - - - 0x000AAF 00:8A9F: C0 04     CPY #$04
C - - - - - 0x000AB1 00:8AA1: D0 F5     BNE $8A98
C - - - - - 0x000AB3 00:8AA3: 20 5E 9B  JSR $9B5E
C - - - - - 0x000AB6 00:8AA6: A5 E8     LDA ram_00E8
C - - - - - 0x000AB8 00:8AA8: 18        CLC
C - - - - - 0x000AB9 00:8AA9: 69 04     ADC #$04
C - - - - - 0x000ABB 00:8AAB: 85 E8     STA ram_00E8
C - - - - - 0x000ABD 00:8AAD: A5 E9     LDA ram_00E9
C - - - - - 0x000ABF 00:8AAF: 69 00     ADC #$00
C - - - - - 0x000AC1 00:8AB1: 85 E9     STA ram_00E9
C - - - - - 0x000AC3 00:8AB3: 60        RTS
- D 0 - - - 0x000AC4 00:8AB4: 06        .byte $06   ; 
- D 0 - - - 0x000AC5 00:8AB5: 07        .byte $07   ; 
- D 0 - - - 0x000AC6 00:8AB6: 08        .byte $08   ; 
- D 0 - - - 0x000AC7 00:8AB7: 09        .byte $09   ; 
- D 0 - - - 0x000AC8 00:8AB8: 0A        .byte $0A   ; 
- D 0 - - - 0x000AC9 00:8AB9: 0B        .byte $0B   ; 
- D 0 - - - 0x000ACA 00:8ABA: 0C        .byte $0C   ; 
- D 0 - - - 0x000ACB 00:8ABB: 0D        .byte $0D   ; 
- D 0 - - - 0x000ACC 00:8ABC: 0E        .byte $0E   ; 
- D 0 - - - 0x000ACD 00:8ABD: 0F        .byte $0F   ; 
- D 0 - - - 0x000ACE 00:8ABE: 10        .byte $10   ; 
- D 0 - - - 0x000ACF 00:8ABF: 11        .byte $11   ; 
- D 0 - - - 0x000AD0 00:8AC0: 12        .byte $12   ; 
- D 0 - - - 0x000AD1 00:8AC1: 13        .byte $13   ; 
- D 0 - - - 0x000AD2 00:8AC2: 14        .byte $14   ; 
- D 0 - - - 0x000AD3 00:8AC3: 1A        .byte $1A   ; 
- D 0 - - - 0x000AD4 00:8AC4: 1B        .byte $1B   ; 
- D 0 - - - 0x000AD5 00:8AC5: 1C        .byte $1C   ; 
- D 0 - - - 0x000AD6 00:8AC6: 1D        .byte $1D   ; 
- D 0 - - - 0x000AD7 00:8AC7: 1E        .byte $1E   ; 
- D 0 - - - 0x000AD8 00:8AC8: 46        .byte $46   ; <F>
- D 0 - - - 0x000AD9 00:8AC9: 47        .byte $47   ; <G>
- D 0 - - - 0x000ADA 00:8ACA: 48        .byte $48   ; <H>
- D 0 - - - 0x000ADB 00:8ACB: 49        .byte $49   ; <I>
- D 0 - - - 0x000ADC 00:8ACC: 4A        .byte $4A   ; <J>
- D 0 - - - 0x000ADD 00:8ACD: 4B        .byte $4B   ; <K>
- D 0 - - - 0x000ADE 00:8ACE: 4C        .byte $4C   ; <L>
- D 0 - - - 0x000ADF 00:8ACF: 4D        .byte $4D   ; <M>
- D 0 - - - 0x000AE0 00:8AD0: 4E        .byte $4E   ; <N>
- D 0 - - - 0x000AE1 00:8AD1: 4F        .byte $4F   ; <O>
- D 0 - - - 0x000AE2 00:8AD2: 50        .byte $50   ; <P>
- - - - - - 0x000AE3 00:8AD3: 51        .byte $51   ; <Q>
- - - - - - 0x000AE4 00:8AD4: 52        .byte $52   ; <R>
- D 0 - - - 0x000AE5 00:8AD5: 53        .byte $53   ; <S>
- D 0 - - - 0x000AE6 00:8AD6: 54        .byte $54   ; <T>
- D 0 - - - 0x000AE7 00:8AD7: 5A        .byte $5A   ; <Z>
- D 0 - - - 0x000AE8 00:8AD8: 5B        .byte $5B   ; 
- D 0 - - - 0x000AE9 00:8AD9: 5C        .byte $5C   ; 
- D 0 - - - 0x000AEA 00:8ADA: 5D        .byte $5D   ; 
- D 0 - - - 0x000AEB 00:8ADB: 5E        .byte $5E   ; 
- D 0 - - - 0x000AEC 00:8ADC: 1A        .byte $1A   ; 
- D 0 - - - 0x000AED 00:8ADD: 1B        .byte $1B   ; 
- D 0 - - - 0x000AEE 00:8ADE: 1C        .byte $1C   ; 
- D 0 - - - 0x000AEF 00:8ADF: 1D        .byte $1D   ; 
- D 0 - - - 0x000AF0 00:8AE0: 1E        .byte $1E   ; 
- D 0 - - - 0x000AF1 00:8AE1: 5A        .byte $5A   ; <Z>
- D 0 - - - 0x000AF2 00:8AE2: 5B        .byte $5B   ; 
- D 0 - - - 0x000AF3 00:8AE3: 5C        .byte $5C   ; 
- D 0 - - - 0x000AF4 00:8AE4: 5D        .byte $5D   ; 
- D 0 - - - 0x000AF5 00:8AE5: 5E        .byte $5E   ; 
- - - - - - 0x000AF6 00:8AE6: 01        .byte $01   ; 
- D 0 - - - 0x000AF7 00:8AE7: 0A        .byte $0A   ; 
- D 0 - - - 0x000AF8 00:8AE8: 14        .byte $14   ; 
- D 0 - - - 0x000AF9 00:8AE9: 28        .byte $28   ; 
- D 0 - - - 0x000AFA 00:8AEA: 3C        .byte $3C   ; 
- D 0 - - - 0x000AFB 00:8AEB: 50        .byte $50   ; <P>
- D 0 - - - 0x000AFC 00:8AEC: 78        .byte $78   ; <x>
- D 0 - - - 0x000AFD 00:8AED: F0        .byte $F0   ; 
- D 0 - - - 0x000AFE 00:8AEE: 00        .byte $00   ; 
- D 0 - - - 0x000AFF 00:8AEF: 03        .byte $03   ; 
- D 0 - - - 0x000B00 00:8AF0: 10        .byte $10   ; 
- D 0 - - - 0x000B01 00:8AF1: 04        .byte $04   ; 
- D 0 - - - 0x000B02 00:8AF2: 20        .byte $20   ; 
- D 0 - - - 0x000B03 00:8AF3: 05        .byte $05   ; 
- D 0 - - - 0x000B04 00:8AF4: 60        .byte $60   ; 
- D 0 - - - 0x000B05 00:8AF5: 06        .byte $06   ; 
- D 0 - - - 0x000B06 00:8AF6: FF        .byte $FF   ; 
C - - - - - 0x000B07 00:8AF7: 85 ED     STA ram_00ED
C - - - - - 0x000B09 00:8AF9: A9 00     LDA #$00
C - - - - - 0x000B0B 00:8AFB: 85 09     STA ram_0009
C - - - - - 0x000B0D 00:8AFD: 85 0A     STA ram_000A
C - - - - - 0x000B0F 00:8AFF: 85 0D     STA ram_000D
C - - - - - 0x000B11 00:8B01: 85 0E     STA ram_000E
C - - - - - 0x000B13 00:8B03: A5 5B     LDA ram_005B
C - - - - - 0x000B15 00:8B05: 29 7F     AND #$7F
C - - - - - 0x000B17 00:8B07: 85 5B     STA ram_005B
C - - - - - 0x000B19 00:8B09: A5 25     LDA ram_0025
C - - - - - 0x000B1B 00:8B0B: 85 77     STA ram_0077
C - - - - - 0x000B1D 00:8B0D: A2 07     LDX #$07
C - - - - - 0x000B1F 00:8B0F: 20 B9 C4  JSR $C4B9
C - - - - - 0x000B22 00:8B12: A9 00     LDA #$00
C - - - - - 0x000B24 00:8B14: A0 F8     LDY #$F8
C - - - - - 0x000B26 00:8B16: 99 52 05  STA ram_0552,Y
C - - - - - 0x000B29 00:8B19: C8        INY
C - - - - - 0x000B2A 00:8B1A: D0 FA     BNE $8B16
C - - - - - 0x000B2C 00:8B1C: A5 ED     LDA ram_00ED
C - - - - - 0x000B2E 00:8B1E: 0A        ASL
C - - - - - 0x000B2F 00:8B1F: AA        TAX
C - - - - - 0x000B30 00:8B20: A9 00     LDA #$00
C - - - - - 0x000B32 00:8B22: 2A        ROL
C - - - - - 0x000B33 00:8B23: A8        TAY
C - - - - - 0x000B34 00:8B24: 8A        TXA
C - - - - - 0x000B35 00:8B25: 18        CLC
C - - - - - 0x000B36 00:8B26: 69 00     ADC #$00
C - - - - - 0x000B38 00:8B28: 85 63     STA ram_0063
C - - - - - 0x000B3A 00:8B2A: 98        TYA
C - - - - - 0x000B3B 00:8B2B: 69 A0     ADC #$A0
C - - - - - 0x000B3D 00:8B2D: 85 64     STA ram_0064
C - - - - - 0x000B3F 00:8B2F: A0 00     LDY #$00
C - - - - - 0x000B41 00:8B31: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B43 00:8B33: AA        TAX
C - - - - - 0x000B44 00:8B34: C8        INY
C - - - - - 0x000B45 00:8B35: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B47 00:8B37: 85 64     STA ram_0064
C - - - - - 0x000B49 00:8B39: 86 63     STX ram_0063
C - - - - - 0x000B4B 00:8B3B: A0 00     LDY #$00
C - - - - - 0x000B4D 00:8B3D: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B4F 00:8B3F: 85 75     STA ram_0075
C - - - - - 0x000B51 00:8B41: C8        INY
C - - - - - 0x000B52 00:8B42: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B54 00:8B44: 85 76     STA ram_0076
C - - - - - 0x000B56 00:8B46: C8        INY
C - - - - - 0x000B57 00:8B47: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B59 00:8B49: AA        TAX
C - - - - - 0x000B5A 00:8B4A: 29 3F     AND #$3F
C - - - - - 0x000B5C 00:8B4C: 85 48     STA ram_0048
C - - - - - 0x000B5E 00:8B4E: 8A        TXA
C - - - - - 0x000B5F 00:8B4F: 46 5B     LSR ram_005B
C - - - - - 0x000B61 00:8B51: 2A        ROL
C - - - - - 0x000B62 00:8B52: 26 5B     ROL ram_005B
C - - - - - 0x000B64 00:8B54: C8        INY
C - - - - - 0x000B65 00:8B55: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B67 00:8B57: 85 5E     STA ram_005E
C - - - - - 0x000B69 00:8B59: C8        INY
C - - - - - 0x000B6A 00:8B5A: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B6C 00:8B5C: 85 5F     STA ram_005F
C - - - - - 0x000B6E 00:8B5E: C8        INY
C - - - - - 0x000B6F 00:8B5F: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B71 00:8B61: 29 F8     AND #$F8
C - - - - - 0x000B73 00:8B63: 85 5C     STA ram_005C
C - - - - - 0x000B75 00:8B65: A9 02     LDA #$02
C - - - - - 0x000B77 00:8B67: 85 5D     STA ram_005D
C - - - - - 0x000B79 00:8B69: 06 5C     ASL ram_005C
C - - - - - 0x000B7B 00:8B6B: 26 5D     ROL ram_005D
C - - - - - 0x000B7D 00:8B6D: 06 5C     ASL ram_005C
C - - - - - 0x000B7F 00:8B6F: 26 5D     ROL ram_005D
C - - - - - 0x000B81 00:8B71: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B83 00:8B73: 29 07     AND #$07
C - - - - - 0x000B85 00:8B75: 05 5C     ORA ram_005C
C - - - - - 0x000B87 00:8B77: 85 5C     STA ram_005C
C - - - - - 0x000B89 00:8B79: 06 5C     ASL ram_005C
C - - - - - 0x000B8B 00:8B7B: 26 5D     ROL ram_005D
C - - - - - 0x000B8D 00:8B7D: 06 5C     ASL ram_005C
C - - - - - 0x000B8F 00:8B7F: 26 5D     ROL ram_005D
C - - - - - 0x000B91 00:8B81: A5 5D     LDA ram_005D
C - - - - - 0x000B93 00:8B83: 29 0C     AND #$0C
C - - - - - 0x000B95 00:8B85: D0 0C     BNE $8B93
C - - - - - 0x000B97 00:8B87: A5 7B     LDA ram_007B
C - - - - - 0x000B99 00:8B89: 0A        ASL
C - - - - - 0x000B9A 00:8B8A: 0A        ASL
C - - - - - 0x000B9B 00:8B8B: 45 5B     EOR ram_005B
C - - - - - 0x000B9D 00:8B8D: 29 04     AND #$04
C - - - - - 0x000B9F 00:8B8F: 05 5D     ORA ram_005D
C - - - - - 0x000BA1 00:8B91: 85 5D     STA ram_005D
C - - - - - 0x000BA3 00:8B93: A5 5E     LDA ram_005E
C - - - - - 0x000BA5 00:8B95: C9 09     CMP #$09
C - - - - - 0x000BA7 00:8B97: 90 06     BCC $8B9F
C - - - - - 0x000BA9 00:8B99: 20 71 90  JSR $9071
C - - - - - 0x000BAC 00:8B9C: 4C AB 8B  JMP $8BAB
C - - - - - 0x000BAF 00:8B9F: A5 5D     LDA ram_005D
C - - - - - 0x000BB1 00:8BA1: 29 04     AND #$04
C - - - - - 0x000BB3 00:8BA3: D0 06     BNE $8BAB
C - - - - - 0x000BB5 00:8BA5: 20 71 90  JSR $9071
C - - - - - 0x000BB8 00:8BA8: 4C AE 8B  JMP $8BAE
C - - - - - 0x000BBB 00:8BAB: 20 76 90  JSR $9076
C D 0 - - - 0x000BBE 00:8BAE: A9 01     LDA #$01
C - - - - - 0x000BC0 00:8BB0: 20 A8 9F  JSR $9FA8
C - - - - - 0x000BC3 00:8BB3: A5 63     LDA ram_0063
C - - - - - 0x000BC5 00:8BB5: 18        CLC
C - - - - - 0x000BC6 00:8BB6: 69 06     ADC #$06
C - - - - - 0x000BC8 00:8BB8: 85 63     STA ram_0063
C - - - - - 0x000BCA 00:8BBA: A5 64     LDA ram_0064
C - - - - - 0x000BCC 00:8BBC: 69 00     ADC #$00
C - - - - - 0x000BCE 00:8BBE: 85 64     STA ram_0064
C - - - - - 0x000BD0 00:8BC0: A5 5E     LDA ram_005E
C - - - - - 0x000BD2 00:8BC2: A6 5F     LDX ram_005F
C - - - - - 0x000BD4 00:8BC4: 20 EE 9D  JSR $9DEE
C - - - - - 0x000BD7 00:8BC7: A5 63     LDA ram_0063
C - - - - - 0x000BD9 00:8BC9: 18        CLC
C - - - - - 0x000BDA 00:8BCA: 65 EC     ADC ram_00EC
C - - - - - 0x000BDC 00:8BCC: 85 70     STA ram_0070
C - - - - - 0x000BDE 00:8BCE: A5 64     LDA ram_0064
C - - - - - 0x000BE0 00:8BD0: 65 ED     ADC ram_00ED
C - - - - - 0x000BE2 00:8BD2: 85 71     STA ram_0071
C - - - - - 0x000BE4 00:8BD4: A9 00     LDA #$00
C - - - - - 0x000BE6 00:8BD6: 85 60     STA ram_0060
C - - - - - 0x000BE8 00:8BD8: A0 01     LDY #$01
C - - - - - 0x000BEA 00:8BDA: B1 70     LDA (ram_0070),Y
C - - - - - 0x000BEC 00:8BDC: 29 E0     AND #$E0
C - - - - - 0x000BEE 00:8BDE: 85 62     STA ram_0062
C - - - - - 0x000BF0 00:8BE0: B1 70     LDA (ram_0070),Y
C - - - - - 0x000BF2 00:8BE2: 29 1F     AND #$1F
C - - - - - 0x000BF4 00:8BE4: AA        TAX
C - - - - - 0x000BF5 00:8BE5: 4A        LSR
C - - - - - 0x000BF6 00:8BE6: 66 60     ROR ram_0060
C - - - - - 0x000BF8 00:8BE8: 4A        LSR
C - - - - - 0x000BF9 00:8BE9: 66 60     ROR ram_0060
C - - - - - 0x000BFB 00:8BEB: 85 61     STA ram_0061
C - - - - - 0x000BFD 00:8BED: 8A        TXA
C - - - - - 0x000BFE 00:8BEE: F0 03     BEQ $8BF3
C - - - - - 0x000C00 00:8BF0: C8        INY
C - - - - - 0x000C01 00:8BF1: B1 70     LDA (ram_0070),Y
C - - - - - 0x000C03 00:8BF3: 85 72     STA ram_0072
C - - - - - 0x000C05 00:8BF5: A5 62     LDA ram_0062
C - - - - - 0x000C07 00:8BF7: 29 C0     AND #$C0
C - - - - - 0x000C09 00:8BF9: F0 48     BEQ $8C43
C - - - - - 0x000C0B 00:8BFB: C9 40     CMP #$40
C - - - - - 0x000C0D 00:8BFD: F0 16     BEQ $8C15
C - - - - - 0x000C0F 00:8BFF: C9 80     CMP #$80
C - - - - - 0x000C11 00:8C01: F0 09     BEQ $8C0C
C - - - - - 0x000C13 00:8C03: A9 04     LDA #$04
C - - - - - 0x000C15 00:8C05: A2 01     LDX #$01
C - - - - - 0x000C17 00:8C07: A4 5F     LDY ram_005F
C - - - - - 0x000C19 00:8C09: 4C 59 8C  JMP $8C59
C - - - - - 0x000C1C 00:8C0C: A9 04     LDA #$04
C - - - - - 0x000C1E 00:8C0E: A2 01     LDX #$01
C - - - - - 0x000C20 00:8C10: A4 5F     LDY ram_005F
C - - - - - 0x000C22 00:8C12: 4C 59 8C  JMP $8C59
C - - - - - 0x000C25 00:8C15: A5 5E     LDA ram_005E
C - - - - - 0x000C27 00:8C17: A6 5F     LDX ram_005F
C - - - - - 0x000C29 00:8C19: 20 EE 9D  JSR $9DEE
C - - - - - 0x000C2C 00:8C1C: A5 EC     LDA ram_00EC
C - - - - - 0x000C2E 00:8C1E: 38        SEC
C - - - - - 0x000C2F 00:8C1F: E9 01     SBC #$01
C - - - - - 0x000C31 00:8C21: 85 EC     STA ram_00EC
C - - - - - 0x000C33 00:8C23: A5 ED     LDA ram_00ED
C - - - - - 0x000C35 00:8C25: E9 00     SBC #$00
C - - - - - 0x000C37 00:8C27: 85 ED     STA ram_00ED
C - - - - - 0x000C39 00:8C29: A5 63     LDA ram_0063
C - - - - - 0x000C3B 00:8C2B: 18        CLC
C - - - - - 0x000C3C 00:8C2C: 65 EC     ADC ram_00EC
C - - - - - 0x000C3E 00:8C2E: 85 63     STA ram_0063
C - - - - - 0x000C40 00:8C30: A5 64     LDA ram_0064
C - - - - - 0x000C42 00:8C32: 65 ED     ADC ram_00ED
C - - - - - 0x000C44 00:8C34: 85 64     STA ram_0064
C - - - - - 0x000C46 00:8C36: A9 00     LDA #$00
C - - - - - 0x000C48 00:8C38: 38        SEC
C - - - - - 0x000C49 00:8C39: E5 5F     SBC ram_005F
C - - - - - 0x000C4B 00:8C3B: A8        TAY
C - - - - - 0x000C4C 00:8C3C: A9 FC     LDA #$FC
C - - - - - 0x000C4E 00:8C3E: A2 FF     LDX #$FF
C - - - - - 0x000C50 00:8C40: 4C 59 8C  JMP $8C59
C - - - - - 0x000C53 00:8C43: A5 5F     LDA ram_005F
C - - - - - 0x000C55 00:8C45: 38        SEC
C - - - - - 0x000C56 00:8C46: E9 01     SBC #$01
C - - - - - 0x000C58 00:8C48: 18        CLC
C - - - - - 0x000C59 00:8C49: 65 63     ADC ram_0063
C - - - - - 0x000C5B 00:8C4B: 85 63     STA ram_0063
C - - - - - 0x000C5D 00:8C4D: A5 64     LDA ram_0064
C - - - - - 0x000C5F 00:8C4F: 69 00     ADC #$00
C - - - - - 0x000C61 00:8C51: 85 64     STA ram_0064
C - - - - - 0x000C63 00:8C53: A9 FC     LDA #$FC
C - - - - - 0x000C65 00:8C55: A2 FF     LDX #$FF
C - - - - - 0x000C67 00:8C57: A4 5F     LDY ram_005F
C D 0 - - - 0x000C69 00:8C59: 85 6D     STA ram_006D
C - - - - - 0x000C6B 00:8C5B: 86 6E     STX ram_006E
C - - - - - 0x000C6D 00:8C5D: 84 6F     STY ram_006F
C - - - - - 0x000C6F 00:8C5F: A5 5E     LDA ram_005E
C - - - - - 0x000C71 00:8C61: C9 07     CMP #$07
C - - - - - 0x000C73 00:8C63: 90 24     BCC $8C89
C - - - - - 0x000C75 00:8C65: 38        SEC
C - - - - - 0x000C76 00:8C66: E9 07     SBC #$07
C - - - - - 0x000C78 00:8C68: 85 5E     STA ram_005E
C - - - - - 0x000C7A 00:8C6A: A0 07     LDY #$07
C - - - - - 0x000C7C 00:8C6C: A6 5F     LDX ram_005F
C - - - - - 0x000C7E 00:8C6E: 20 15 8E  JSR $8E15
C - - - - - 0x000C81 00:8C71: A9 01     LDA #$01
C - - - - - 0x000C83 00:8C73: 85 7B     STA ram_007B
C - - - - - 0x000C85 00:8C75: A2 09     LDX #$09
C - - - - - 0x000C87 00:8C77: A9 B9     LDA #$B9
C - - - - - 0x000C89 00:8C79: 95 00     STA ram_0000,X
C - - - - - 0x000C8B 00:8C7B: A9 8C     LDA #$8C
C - - - - - 0x000C8D 00:8C7D: 95 01     STA ram_0001,X
C - - - - - 0x000C8F 00:8C7F: A0 78     LDY #$78
C - - - - - 0x000C91 00:8C81: A9 00     LDA #$00
C - - - - - 0x000C93 00:8C83: 20 69 9F  JSR $9F69
C - - - - - 0x000C96 00:8C86: 4C A5 8C  JMP $8CA5
C - - - - - 0x000C99 00:8C89: A4 5E     LDY ram_005E
C - - - - - 0x000C9B 00:8C8B: A6 5F     LDX ram_005F
C - - - - - 0x000C9D 00:8C8D: 20 15 8E  JSR $8E15
C - - - - - 0x000CA0 00:8C90: A5 72     LDA ram_0072
C - - - - - 0x000CA2 00:8C92: F0 11     BEQ $8CA5
C - - - - - 0x000CA4 00:8C94: A2 09     LDX #$09
C - - - - - 0x000CA6 00:8C96: A9 21     LDA #$21
C - - - - - 0x000CA8 00:8C98: 95 00     STA ram_0000,X
C - - - - - 0x000CAA 00:8C9A: A9 8D     LDA #$8D
C - - - - - 0x000CAC 00:8C9C: 95 01     STA ram_0001,X
C - - - - - 0x000CAE 00:8C9E: A0 78     LDY #$78
C - - - - - 0x000CB0 00:8CA0: A9 00     LDA #$00
C - - - - - 0x000CB2 00:8CA2: 20 69 9F  JSR $9F69
C D 0 - - - 0x000CB5 00:8CA5: A5 75     LDA ram_0075
C - - - - - 0x000CB7 00:8CA7: 85 8E     STA ram_008E
C - - - - - 0x000CB9 00:8CA9: A5 76     LDA ram_0076
C - - - - - 0x000CBB 00:8CAB: 85 8F     STA ram_008F
C - - - - - 0x000CBD 00:8CAD: A9 00     LDA #$00
C - - - - - 0x000CBF 00:8CAF: 85 44     STA ram_0044
C - - - - - 0x000CC1 00:8CB1: 85 45     STA ram_0045
C - - - - - 0x000CC3 00:8CB3: 85 7A     STA ram_007A
C - - - - - 0x000CC5 00:8CB5: A6 77     LDX ram_0077
C - - - - - 0x000CC7 00:8CB7: 4C B9 C4  JMP $C4B9
C - - - - - 0x000CCA 00:8CBA: A2 07     LDX #$07
C - - - - - 0x000CCC 00:8CBC: 20 B9 C4  JSR $C4B9
C - - - - - 0x000CCF 00:8CBF: A9 00     LDA #$00
C - - - - - 0x000CD1 00:8CC1: 85 69     STA ram_0069
C - - - - - 0x000CD3 00:8CC3: 85 6A     STA ram_006A
C - - - - - 0x000CD5 00:8CC5: 24 62     BIT ram_0062
C - - - - - 0x000CD7 00:8CC7: 30 0D     BMI $8CD6
C - - - - - 0x000CD9 00:8CC9: A9 00     LDA #$00
C - - - - - 0x000CDB 00:8CCB: 38        SEC
C - - - - - 0x000CDC 00:8CCC: E5 60     SBC ram_0060
C - - - - - 0x000CDE 00:8CCE: 85 60     STA ram_0060
C - - - - - 0x000CE0 00:8CD0: A9 00     LDA #$00
C - - - - - 0x000CE2 00:8CD2: E5 61     SBC ram_0061
C - - - - - 0x000CE4 00:8CD4: 85 61     STA ram_0061
C - - - - - 0x000CE6 00:8CD6: A9 01     LDA #$01
C - - - - - 0x000CE8 00:8CD8: 20 A8 9F  JSR $9FA8
C - - - - - 0x000CEB 00:8CDB: A5 60     LDA ram_0060
C - - - - - 0x000CED 00:8CDD: 18        CLC
C - - - - - 0x000CEE 00:8CDE: 65 69     ADC ram_0069
C - - - - - 0x000CF0 00:8CE0: 85 69     STA ram_0069
C - - - - - 0x000CF2 00:8CE2: A9 00     LDA #$00
C - - - - - 0x000CF4 00:8CE4: 65 61     ADC ram_0061
C - - - - - 0x000CF6 00:8CE6: AA        TAX
C - - - - - 0x000CF7 00:8CE7: 20 A9 9B  JSR $9BA9
C - - - - - 0x000CFA 00:8CEA: 8A        TXA
C - - - - - 0x000CFB 00:8CEB: 10 05     BPL $8CF2
C - - - - - 0x000CFD 00:8CED: 49 FF     EOR #$FF
C - - - - - 0x000CFF 00:8CEF: 18        CLC
C - - - - - 0x000D00 00:8CF0: 69 01     ADC #$01
C - - - - - 0x000D02 00:8CF2: 18        CLC
C - - - - - 0x000D03 00:8CF3: 65 6A     ADC ram_006A
C - - - - - 0x000D05 00:8CF5: 85 6A     STA ram_006A
C - - - - - 0x000D07 00:8CF7: 38        SEC
C - - - - - 0x000D08 00:8CF8: E9 20     SBC #$20
C - - - - - 0x000D0A 00:8CFA: 90 DA     BCC $8CD6
C - - - - - 0x000D0C 00:8CFC: 85 6A     STA ram_006A
C - - - - - 0x000D0E 00:8CFE: A5 5B     LDA ram_005B
C - - - - - 0x000D10 00:8D00: 10 08     BPL $8D0A
- - - - - - 0x000D12 00:8D02: A9        .byte $A9   ; 
- - - - - - 0x000D13 00:8D03: 01        .byte $01   ; 
- - - - - - 0x000D14 00:8D04: 20        .byte $20   ; 
- - - - - - 0x000D15 00:8D05: A8        .byte $A8   ; 
- - - - - - 0x000D16 00:8D06: 9F        .byte $9F   ; 
- - - - - - 0x000D17 00:8D07: 4C        .byte $4C   ; <L>
- - - - - - 0x000D18 00:8D08: FE        .byte $FE   ; 
- - - - - - 0x000D19 00:8D09: 8C        .byte $8C   ; 
C - - - - - 0x000D1A 00:8D0A: A2 0D     LDX #$0D
C - - - - - 0x000D1C 00:8D0C: A9 FE     LDA #$FE
C - - - - - 0x000D1E 00:8D0E: 95 00     STA ram_0000,X
C - - - - - 0x000D20 00:8D10: A9 8D     LDA #$8D
C - - - - - 0x000D22 00:8D12: 95 01     STA ram_0001,X
C - - - - - 0x000D24 00:8D14: A0 A0     LDY #$A0
C - - - - - 0x000D26 00:8D16: A9 00     LDA #$00
C - - - - - 0x000D28 00:8D18: 20 69 9F  JSR $9F69
C - - - - - 0x000D2B 00:8D1B: C6 5E     DEC ram_005E
C - - - - - 0x000D2D 00:8D1D: D0 B7     BNE $8CD6
C - - - - - 0x000D2F 00:8D1F: 4C 59 8D  JMP $8D59
C D 0 - - - 0x000D32 00:8D22: A2 07     LDX #$07
C - - - - - 0x000D34 00:8D24: 20 B9 C4  JSR $C4B9
C - - - - - 0x000D37 00:8D27: A2 02     LDX #$02
C - - - - - 0x000D39 00:8D29: A0 00     LDY #$00
C - - - - - 0x000D3B 00:8D2B: B1 70     LDA (ram_0070),Y
C - - - - - 0x000D3D 00:8D2D: F0 0B     BEQ $8D3A
C - - - - - 0x000D3F 00:8D2F: 0A        ASL
C - - - - - 0x000D40 00:8D30: 90 09     BCC $8D3B
C - - - - - 0x000D42 00:8D32: AA        TAX
C - - - - - 0x000D43 00:8D33: A9 FE     LDA #$FE
C - - - - - 0x000D45 00:8D35: 20 A8 9F  JSR $9FA8
C - - - - - 0x000D48 00:8D38: E8        INX
C - - - - - 0x000D49 00:8D39: E8        INX
C - - - - - 0x000D4A 00:8D3A: 8A        TXA
C - - - - - 0x000D4B 00:8D3B: 20 A8 9F  JSR $9FA8
C - - - - - 0x000D4E 00:8D3E: A9 00     LDA #$00
C - - - - - 0x000D50 00:8D40: 85 69     STA ram_0069
C - - - - - 0x000D52 00:8D42: 85 6A     STA ram_006A
C - - - - - 0x000D54 00:8D44: 24 62     BIT ram_0062
C - - - - - 0x000D56 00:8D46: 30 0D     BMI $8D55
C - - - - - 0x000D58 00:8D48: A9 00     LDA #$00
C - - - - - 0x000D5A 00:8D4A: 38        SEC
C - - - - - 0x000D5B 00:8D4B: E5 60     SBC ram_0060
C - - - - - 0x000D5D 00:8D4D: 85 60     STA ram_0060
C - - - - - 0x000D5F 00:8D4F: A9 00     LDA #$00
C - - - - - 0x000D61 00:8D51: E5 61     SBC ram_0061
C - - - - - 0x000D63 00:8D53: 85 61     STA ram_0061
C - - - - - 0x000D65 00:8D55: 24 62     BIT ram_0062
C - - - - - 0x000D67 00:8D57: 50 2F     BVC $8D88
C D 0 - - - 0x000D69 00:8D59: A9 01     LDA #$01
C - - - - - 0x000D6B 00:8D5B: 20 A8 9F  JSR $9FA8
C - - - - - 0x000D6E 00:8D5E: A5 60     LDA ram_0060
C - - - - - 0x000D70 00:8D60: 18        CLC
C - - - - - 0x000D71 00:8D61: 65 69     ADC ram_0069
C - - - - - 0x000D73 00:8D63: 85 69     STA ram_0069
C - - - - - 0x000D75 00:8D65: A9 00     LDA #$00
C - - - - - 0x000D77 00:8D67: 65 61     ADC ram_0061
C - - - - - 0x000D79 00:8D69: AA        TAX
C - - - - - 0x000D7A 00:8D6A: 20 A9 9B  JSR $9BA9
C - - - - - 0x000D7D 00:8D6D: 8A        TXA
C - - - - - 0x000D7E 00:8D6E: 10 05     BPL $8D75
C - - - - - 0x000D80 00:8D70: 49 FF     EOR #$FF
C - - - - - 0x000D82 00:8D72: 18        CLC
C - - - - - 0x000D83 00:8D73: 69 01     ADC #$01
C - - - - - 0x000D85 00:8D75: 18        CLC
C - - - - - 0x000D86 00:8D76: 65 6A     ADC ram_006A
C - - - - - 0x000D88 00:8D78: 85 6A     STA ram_006A
C - - - - - 0x000D8A 00:8D7A: 38        SEC
C - - - - - 0x000D8B 00:8D7B: E9 20     SBC #$20
C - - - - - 0x000D8D 00:8D7D: 90 DA     BCC $8D59
C - - - - - 0x000D8F 00:8D7F: 85 6A     STA ram_006A
C - - - - - 0x000D91 00:8D81: C6 72     DEC ram_0072
C - - - - - 0x000D93 00:8D83: D0 D4     BNE $8D59
C - - - - - 0x000D95 00:8D85: 4C C8 8D  JMP $8DC8
C - - - - - 0x000D98 00:8D88: A9 01     LDA #$01
C - - - - - 0x000D9A 00:8D8A: 20 A8 9F  JSR $9FA8
C - - - - - 0x000D9D 00:8D8D: A5 60     LDA ram_0060
C - - - - - 0x000D9F 00:8D8F: 18        CLC
C - - - - - 0x000DA0 00:8D90: 65 69     ADC ram_0069
C - - - - - 0x000DA2 00:8D92: 85 69     STA ram_0069
C - - - - - 0x000DA4 00:8D94: A9 00     LDA #$00
C - - - - - 0x000DA6 00:8D96: 65 61     ADC ram_0061
C - - - - - 0x000DA8 00:8D98: AA        TAX
C - - - - - 0x000DA9 00:8D99: 20 CA 9B  JSR $9BCA
C - - - - - 0x000DAC 00:8D9C: 8A        TXA
C - - - - - 0x000DAD 00:8D9D: 10 05     BPL $8DA4
C - - - - - 0x000DAF 00:8D9F: 49 FF     EOR #$FF
C - - - - - 0x000DB1 00:8DA1: 18        CLC
C - - - - - 0x000DB2 00:8DA2: 69 01     ADC #$01
C - - - - - 0x000DB4 00:8DA4: 18        CLC
C - - - - - 0x000DB5 00:8DA5: 65 6A     ADC ram_006A
C - - - - - 0x000DB7 00:8DA7: 85 6A     STA ram_006A
C - - - - - 0x000DB9 00:8DA9: 38        SEC
C - - - - - 0x000DBA 00:8DAA: E9 20     SBC #$20
C - - - - - 0x000DBC 00:8DAC: 90 DA     BCC $8D88
C - - - - - 0x000DBE 00:8DAE: 85 6A     STA ram_006A
C - - - - - 0x000DC0 00:8DB0: C6 72     DEC ram_0072
C - - - - - 0x000DC2 00:8DB2: D0 D4     BNE $8D88
C - - - - - 0x000DC4 00:8DB4: A5 7A     LDA ram_007A
C - - - - - 0x000DC6 00:8DB6: 38        SEC
C - - - - - 0x000DC7 00:8DB7: E5 6A     SBC ram_006A
C - - - - - 0x000DC9 00:8DB9: 85 7A     STA ram_007A
C - - - - - 0x000DCB 00:8DBB: A5 7B     LDA ram_007B
C - - - - - 0x000DCD 00:8DBD: E9 00     SBC #$00
C - - - - - 0x000DCF 00:8DBF: 85 7B     STA ram_007B
C - - - - - 0x000DD1 00:8DC1: A5 47     LDA ram_0047
C - - - - - 0x000DD3 00:8DC3: 38        SEC
C - - - - - 0x000DD4 00:8DC4: E5 6A     SBC ram_006A
C - - - - - 0x000DD6 00:8DC6: 85 47     STA ram_0047
C D 0 - - - 0x000DD8 00:8DC8: A5 62     LDA ram_0062
C - - - - - 0x000DDA 00:8DCA: 29 20     AND #$20
C - - - - - 0x000DDC 00:8DCC: D0 2E     BNE $8DFC
C - - - - - 0x000DDE 00:8DCE: A5 70     LDA ram_0070
C - - - - - 0x000DE0 00:8DD0: 18        CLC
C - - - - - 0x000DE1 00:8DD1: 69 03     ADC #$03
C - - - - - 0x000DE3 00:8DD3: 85 70     STA ram_0070
C - - - - - 0x000DE5 00:8DD5: A5 71     LDA ram_0071
C - - - - - 0x000DE7 00:8DD7: 69 00     ADC #$00
C - - - - - 0x000DE9 00:8DD9: 85 71     STA ram_0071
C - - - - - 0x000DEB 00:8DDB: A9 00     LDA #$00
C - - - - - 0x000DED 00:8DDD: 85 60     STA ram_0060
C - - - - - 0x000DEF 00:8DDF: A0 01     LDY #$01
C - - - - - 0x000DF1 00:8DE1: B1 70     LDA (ram_0070),Y
C - - - - - 0x000DF3 00:8DE3: 29 E0     AND #$E0
C - - - - - 0x000DF5 00:8DE5: 85 62     STA ram_0062
C - - - - - 0x000DF7 00:8DE7: B1 70     LDA (ram_0070),Y
C - - - - - 0x000DF9 00:8DE9: 29 1F     AND #$1F
C - - - - - 0x000DFB 00:8DEB: AA        TAX
C - - - - - 0x000DFC 00:8DEC: 4A        LSR
C - - - - - 0x000DFD 00:8DED: 66 60     ROR ram_0060
C - - - - - 0x000DFF 00:8DEF: 4A        LSR
C - - - - - 0x000E00 00:8DF0: 66 60     ROR ram_0060
C - - - - - 0x000E02 00:8DF2: 85 61     STA ram_0061
C - - - - - 0x000E04 00:8DF4: C8        INY
C - - - - - 0x000E05 00:8DF5: B1 70     LDA (ram_0070),Y
C - - - - - 0x000E07 00:8DF7: 85 72     STA ram_0072
C - - - - - 0x000E09 00:8DF9: 4C 22 8D  JMP $8D22
C - - - - - 0x000E0C 00:8DFC: 4C 7E 9F  JMP $9F7E
C - - - - - 0x000E0F 00:8DFF: A5 5B     LDA ram_005B
C - - - - - 0x000E11 00:8E01: 09 80     ORA #$80
C - - - - - 0x000E13 00:8E03: 85 5B     STA ram_005B
C - - - - - 0x000E15 00:8E05: A0 01     LDY #$01
C - - - - - 0x000E17 00:8E07: A6 5F     LDX ram_005F
C - - - - - 0x000E19 00:8E09: 20 15 8E  JSR $8E15
C - - - - - 0x000E1C 00:8E0C: A5 5B     LDA ram_005B
C - - - - - 0x000E1E 00:8E0E: 29 7F     AND #$7F
C - - - - - 0x000E20 00:8E10: 85 5B     STA ram_005B
C - - - - - 0x000E22 00:8E12: 4C 7E 9F  JMP $9F7E
C - - - - - 0x000E25 00:8E15: 84 6C     STY ram_006C
C - - - - - 0x000E27 00:8E17: 86 6B     STX ram_006B
C D 0 - - - 0x000E29 00:8E19: A5 63     LDA ram_0063
C - - - - - 0x000E2B 00:8E1B: 85 65     STA ram_0065
C - - - - - 0x000E2D 00:8E1D: A5 64     LDA ram_0064
C - - - - - 0x000E2F 00:8E1F: 85 66     STA ram_0066
C - - - - - 0x000E31 00:8E21: A5 6B     LDA ram_006B
C - - - - - 0x000E33 00:8E23: 85 ED     STA ram_00ED
C - - - - - 0x000E35 00:8E25: A5 5C     LDA ram_005C
C - - - - - 0x000E37 00:8E27: 85 73     STA ram_0073
C - - - - - 0x000E39 00:8E29: A5 5D     LDA ram_005D
C - - - - - 0x000E3B 00:8E2B: 85 74     STA ram_0074
C - - - - - 0x000E3D 00:8E2D: A0 00     LDY #$00
C - - - - - 0x000E3F 00:8E2F: B1 63     LDA (ram_0063),Y
C - - - - - 0x000E41 00:8E31: 20 F0 8E  JSR $8EF0
C - - - - - 0x000E44 00:8E34: A5 5C     LDA ram_005C
C - - - - - 0x000E46 00:8E36: AA        TAX
C - - - - - 0x000E47 00:8E37: 18        CLC
C - - - - - 0x000E48 00:8E38: 65 6D     ADC ram_006D
C - - - - - 0x000E4A 00:8E3A: 85 5C     STA ram_005C
C - - - - - 0x000E4C 00:8E3C: 8A        TXA
C - - - - - 0x000E4D 00:8E3D: 45 5C     EOR ram_005C
C - - - - - 0x000E4F 00:8E3F: 29 20     AND #$20
C - - - - - 0x000E51 00:8E41: F0 15     BEQ $8E58
C - - - - - 0x000E53 00:8E43: A5 6D     LDA ram_006D
C - - - - - 0x000E55 00:8E45: 0A        ASL